_protected/views/site/dashboard.php

use yii\helpers\Url;
?>

<?php if(count($user->groups) > 0){ ?>
---
SELECT * FROM `group` WHERE `user_id`=6