_protected/controllers/GroupController.php

    public function actionView($slug, $embed=false, $hide='')
    {
        if (($model =Group::find()->where(['slug'=>$slug])->one()) == null) {
---
SELECT * FROM `group` WHERE `slug`='demo'

			],
		]);

		$num_regions = (new \yii\db\Query())
			->select(['count(DISTINCT(region)) as regcount'])
			->from('group_assignment')
			->where(['group_id'=>$model->id])
			->one()['regcount'];
---
SELECT count(DISTINCT(region)) as regcount FROM `group_assignment` WHERE `group_id`=5