_protected/controllers/SiteController.php

    public function actionIndex()
    {
		if(Yii::$app->user->isGuest){
			return $this->render('index');
		}else{
			$user = User::findOne(Yii::$app->user->id);
---
SELECT * FROM `user` WHERE `id`=6

    public function actionAccount()
    {
		$id = $this->user->id;
        // get user details
        $user = $model = User::findOne($id);
---
SELECT * FROM `user` WHERE `id`=6