_protected/controllers/UpdateController.php

    public function actionGroup($group_id)
    {
		\Yii::$app->response->format = 'json';

        if (($model =Group::find()->where(['id'=>$group_id])->one()) == null) {
---
SELECT * FROM `group` WHERE `id`='5'

						$past_username->lolid = $data['id'];
						$past_username->past_username = $region_sort[$region][$data['id']]->styled_name;
						$past_username->current_username = $data['name'];
						$past_username->save(false);
---
INSERT INTO `past_usernames` (`region`, `lolid`, `past_username`, `current_username`) VALUES (1, 30033949, '? ?', '뿌 꾸')