_protected/components/GenericFunctions.php

	public function getRegioncode($id){
		return RegionIndex::find()->where(['id'=>$id])->one()->code;
---
SELECT * FROM `region_index` WHERE `id`=1