_protected/models/User.php

    public static function findByPasswordResetToken($token)
    {
        if (!static::isPasswordResetTokenValid($token))
        {
            return null;
        }

        return static::findOne([
            'password_reset_token' => $token,
            'status' => User::STATUS_ACTIVE,
        ]);
---
SELECT * FROM `user` WHERE (`password_reset_token`='G90tQmhwUoRcvhJqKCvMqpq8_MJfgHj6_1429591428') AND (`status`=10)